Revit 2027 API
StructuralAsset.WoodBendingStrength Property
 The bending strength of the asset.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double WoodBendingStrength { get; set; }
Public Property WoodBendingStrength As Double
	Get
	Set
public:
property double WoodBendingStrength {
	double get ();
	void set (double value);
}
member WoodBendingStrength : float with get, set
Property Value
Double
Exceptions
Exception | Condition
InapplicableDataException |  When setting this property: the material type must be wood to set this property.
Remarks
 Applies to wood-based structural assets. The value is in Newtons per foot meter (N/(ft · m)).
See Also
Reference
StructuralAsset Class
Autodesk.Revit.DB Namespace